# Carga de datos en la base de datos

In [1]:
!echo 'learner' | sudo -S -u postgres psql -c "alter user postgres with password 'learner';"

[sudo] password for learner: ALTER ROLE

In [2]:
!echo 'learner' | sudo -S -u postgres dropdb tajetasblack

[sudo] password for learner:

In [3]:
!echo 'learner' | sudo -S -u postgres createdb tajetasblack

[sudo] password for learner:

In [4]:
!echo 'learner' |  sudo -S -u postgres pg_restore -U postgres -d tajetasblack data/tarjetasblack.tar.gz

[sudo] password for learner:

# Black Cards

This dataset contains details of the movements of the different credit cards that belonged to the members of the board of directors of Caja Madrid, in the case known as Black Cards:

https://www.cuartopoder.es/multimedia/2014/10/11/gastos-de-los-exdirectivos-de-caja-madrid-uno-a-uno-con-las-tarjetas-negras-tabla/3403

The database has the following relationship entity model:

![png](./https://github.com/Santiesb/SQL-Exercises/blob/master/Relationship_tables.PNG)

The tables contain the following information:

- The **counselor** table contains details of the person who incurred the expenditure
- The **movement** table stores the details of the charge made to the credit card
- Table **trade** stores data on the trade where the debit was made
- The table **activity** contains a classification of the different activities to which a trade can be devoted

# Connecting to the database

In [5]:
%load_ext sql
%sql postgresql://postgres:learner@localhost/tajetasblack

u'Connected: postgres@tajetasblack'

# Queries

In [6]:
%%sql 

SELECT *
FROM consejero
LIMIT 2;

2 rows affected.

[(1, u'Alberto Recarte Garc\xeda Andrade', u'concejal', u'Partido Popular'),
 (2, u'Alejandro Couceiro Ojeda', u'concejal', u'CEIM')]

# Exercise 1
### Get the whole activity chart

In [7]:
%%sql

SELECT *
FROM actividad;

36 rows affected.

[(1, u'ROPA'),
 (2, u'HOTEL'),
 (3, u'RESTAURANTE'),
 (4, u'COCHE'),
 (5, u'COMPRA BIENES'),
 (6, u'TELECOM'),
 (7, u'MISC'),
 (8, u'AVION'),
 (9, u'REGALOS'),
 (10, u'SOCIAL'),
 (11, u'DIRECT MARKETING'),
 (12, u'LIBRERIA'),
 (13, u'SALIDAS'),
 (14, u'TREN'),
 (15, u'SUPERMERCADO'),
 (16, u'DEPORTE'),
 (17, u'VIAJE'),
 (18, u'HOGAR'),
 (19, u'BUSINESS'),
 (20, u'DUTYFREE'),
 (21, u'BANCO'),
 (22, u'IMAGEN'),
 (23, u'COMPRA BIENES LUJO'),
 (24, u'ESTETICA'),
 (25, u'SALUD'),
 (26, u'ESCUELA'),
 (27, u'MUEBLES'),
 (28, u'CASINO'),
 (29, u'BEBIDAS'),
 (30, u'BARCO'),
 (31, u'TABACO'),
 (32, u'CA$H'),
 (33, u'ARTE'),
 (34, u'SEGUROS'),
 (35, u'AGRICULTURA'),
 (36, u'FUNERARIAS')]

# Exercise 2
### Get 5 activities

In [8]:
%%sql

SELECT *
FROM actividad
LIMIT 5;

5 rows affected.

[(1, u'ROPA'),
 (2, u'HOTEL'),
 (3, u'RESTAURANTE'),
 (4, u'COCHE'),
 (5, u'COMPRA BIENES')]

# Exercise 3
### Get 5 activities sorted by activity name (ascending)

In [9]:
%%sql

SELECT *
FROM actividad
ORDER BY actividad asc
LIMIT 5;

5 rows affected.

[(35, u'AGRICULTURA'),
 (33, u'ARTE'),
 (8, u'AVION'),
 (21, u'BANCO'),
 (30, u'BARCO')]

# Exercise 4
### Get 5 shops sorted by their id (descending)

In [10]:
%%sql

SELECT comercio, actividad_completa
FROM comercio
ORDER BY id_comercio desc
LIMIT 5;

5 rows affected.

[(u'LAZCANO', u'SUPERMERCADOS,ULTRAMARINOS, ECONOMATOS'),
 (u'RESTAURANTE OR DAGO', u'RESTAURANTES RESTO'),
 (u'PORTO ALEGRE II', u'RESTAURANTES RESTO'),
 (u'PC CITY S.SEBASTIAN REYES', u'ELECTRODOMESTICOS,EQUIPOS ELECTRICOS'),
 (u'SIDRERIA RESTAURANTE GAZTELUPE', u'RESTAURANTES RESTO')]

# Exercise 5
### On the table of movements, show the number of days that have passed since the date 1/5/2017 sorted in ascending order, only 5 records

In [11]:
%%sql

select '2017-5-1' - fecha as "Número de días",
fecha
from movimiento
order by "Número de días" asc
limit 5;

5 rows affected.

[(1707, datetime.date(2012, 8, 28)),
 (1817, datetime.date(2012, 5, 10)),
 (1819, datetime.date(2012, 5, 8)),
 (1820, datetime.date(2012, 5, 7)),
 (1821, datetime.date(2012, 5, 6))]

# Exercise 6
### On the movements' table, increase the amount by 15%, showing only 2 decimals sorted by date, hour, minute (ascending). Only 5 records

In [12]:
%%sql

select fecha, hora, minuto, round(importe + importe*0.15,2) as "importe + 15%"
from movimiento
order by fecha, hora, minuto asc
limit 5;

5 rows affected.

[(datetime.date(2002, 12, 31), 11, 2, Decimal('73.89')),
 (datetime.date(2002, 12, 31), 11, 2, Decimal('26.11')),
 (datetime.date(2002, 12, 31), 11, 3, Decimal('432.40')),
 (datetime.date(2002, 12, 31), 11, 13, Decimal('154.66')),
 (datetime.date(2002, 12, 31), 11, 13, Decimal('55.29'))]

# Exercise 7
### On the board of directors' table, show the name and position in ascending order. Only 5 records

In [13]:
%%sql

select nombre || ' es ' || funcion as "Consejero"
from consejero
limit 5;

5 rows affected.

[(u'Alberto Recarte Garc\xeda Andrade es concejal',),
 (u'Alejandro Couceiro Ojeda es concejal',),
 (u'\xc1ngel Eugenio G\xf3mez del Pulgar Perales es concejal',),
 (u'Angel Rizaldos Gonz\xe1lez es concejal',),
 (u'Antonio C\xe1mara Eguinoa es concejal',)]

# Exercise 8
### Show the councillors of the People's Party' sorted by name. Only 5 records

In [14]:
%%sql
select id_consejero, nombre
from consejero 
where funcion = 'concejal'
    and organizacion = 'Partido Popular'
limit 5

5 rows affected.

[(1, u'Alberto Recarte Garc\xeda Andrade'),
 (5, u'Antonio C\xe1mara Eguinoa'),
 (9, u'Beltr\xe1n Guti\xe9rrez Moliner'),
 (10, u'C\xe1ndido Cer\xf3n Escudero'),
 (11, u'Rafael Dar\xedo Fern\xe1ndez Yruegas Moro')]

# Exercise 9
### Show the movements whose amount is greater than 1023 euros and less than 1400 euros sorted by amount. Only 5 records

In [15]:
%%sql

select *
from movimiento
where importe between 1023 
                and 1400
order by importe
limit 5;

5 rows affected.

[(33910, datetime.date(2011, 7, 10), 10, 1, Decimal('1024.16'), 38, 7147),
 (62166, datetime.date(2008, 12, 7), 13, 39, Decimal('1024.65'), 65, 12074),
 (24810, datetime.date(2008, 6, 4), 19, 29, Decimal('1025.0'), 27, 5593),
 (66222, datetime.date(2007, 11, 11), 17, 41, Decimal('1028.05'), 69, 1076),
 (32979, datetime.date(2006, 9, 16), 17, 19, Decimal('1030.59'), 38, 736)]

# Exercise 10
### Show the counselors whose ids correspond to numbers 1, 2, 3, 5, 7 and 10

In [16]:
%%sql 
select * 
from consejero
where id_consejero in (1,2,3,5,7,10);

6 rows affected.

[(1, u'Alberto Recarte Garc\xeda Andrade', u'concejal', u'Partido Popular'),
 (2, u'Alejandro Couceiro Ojeda', u'concejal', u'CEIM'),
 (3, u'\xc1ngel Eugenio G\xf3mez del Pulgar Perales', u'concejal', u'PSOE'),
 (5, u'Antonio C\xe1mara Eguinoa', u'concejal', u'Partido Popular'),
 (7, u'Antonio Romero L\xe1zaro', u'concejal', u'PSOE'),
 (10, u'C\xe1ndido Cer\xf3n Escudero', u'concejal', u'Partido Popular')]

# Exercise 11
### Show the shops without the activity identifier

In [17]:
%%sql 
select id_comercio, comercio, actividad_completa, id_actividad
from comercio
where id_actividad is null;

4 rows affected.

[(4472, None, None, None),
 (9412, u'BLANCO-SUMMER-CC.ZIELO', u'BLANCO', None),
 (12725, u'SALA RETIRO CAJA DE MADRID', None, None),
 (13277, u'MOVISTAR', None, None)]

# Exercise 12
### Obtain businesses sorted by their name in descending order, that do not have a null name and do not have an ID whose value is 650 or 6788. Only 5 records

In [18]:
%%sql

select id_comercio, comercio, actividad_completa
from comercio
where comercio is not null
    and id_comercio not in ('650', '6788')
order by comercio desc
limit 5

5 rows affected.

[(12863, u'ZUBEROA JATEXEA', u'RESTAURANTES DE 4 Y 5 TENEDORES'),
 (1352, u'ZORZAL', u'RESTAURANTES RESTO'),
 (7322, u'ZOO AQUARIUM MADRID - TPV PC', u'ESPECTACULOS Y DEPORTES'),
 (3567, u'ZOO AQUARIUM', u'ESPECTACULOS Y DEPORTES'),
 (7066, u'ZONULA S.L.', u'FOTOGRAFIA,EQUIPOS CINE,OPTICA,INST.MEDI')]

# Exercise 13
### Show the counselors whose first name begins with A and their last name with R. Sorted by name (ascending)

In [48]:
%%sql
--Si quieres sacar la segunda letra, por ejemplo -> '_A%'
select id_consejero, nombre, funcion, organizacion
from consejero
where nombre like 'A% R%'

4 rows affected.

[(1, u'Alberto Recarte Garc\xeda Andrade', u'concejal', u'Partido Popular'),
 (4, u'Angel Rizaldos Gonz\xe1lez', u'concejal', u'Izquierda Unida'),
 (6, u'Antonio Rey de Vi\xf1as S\xe1nchez-Majestad', u'concejal', u'CC OO'),
 (7, u'Antonio Romero L\xe1zaro', u'concejal', u'PSOE')]

# Exercise 14
### Join the counselors whose ID is 1, 2 and 3 with the counselors whose ID is 3, 4 and 5. Sort it by ID

In [20]:
%%sql

select id_consejero, nombre, funcion, organizacion
from consejero
where id_consejero in (1,2,3)
union all
select id_consejero, nombre, funcion, organizacion
from consejero
where id_consejero in (3,4,5)
order by id_consejero

6 rows affected.

[(1, u'Alberto Recarte Garc\xeda Andrade', u'concejal', u'Partido Popular'),
 (2, u'Alejandro Couceiro Ojeda', u'concejal', u'CEIM'),
 (3, u'\xc1ngel Eugenio G\xf3mez del Pulgar Perales', u'concejal', u'PSOE'),
 (3, u'\xc1ngel Eugenio G\xf3mez del Pulgar Perales', u'concejal', u'PSOE'),
 (4, u'Angel Rizaldos Gonz\xe1lez', u'concejal', u'Izquierda Unida'),
 (5, u'Antonio C\xe1mara Eguinoa', u'concejal', u'Partido Popular')]

# Exercise 15
### Show the different roles of counselors

In [21]:
%%sql

select distinct funcion
from consejero

2 rows affected.

[(u'concejal',), (u'directivo',)]

# Exercise 16
### Display the total of the transactions, the minimum, maximum and average amount (2 decimals), for all positive amounts

In [22]:
%%sql

select count(id_movimiento) as "Total Movimientos",
min(importe) as "Importe Mínimo",
max(importe) as "Importe Máximo",
round(avg(importe),2) as "Importe Medio"
from movimiento
    where importe > 0

1 rows affected.

[(75567L, Decimal('0.05'), Decimal('16921.75'), Decimal('156.46'))]

# Exercise 17
### Get the average daily amount, dividing the total amount by the number of days from the first move to the last move

In [23]:
%%sql

select min(fecha) as "Inicio",
max(fecha) as "Fin",
max(fecha) - min(fecha) as "Número de días",
round(sum(importe) / (max(fecha) - min(fecha)),2) as "Importe Medio Diario"
from movimiento

1 rows affected.

[(datetime.date(2002, 12, 31), datetime.date(2012, 8, 28), 3528, Decimal('3304.76'))]

# Exercise 18
### Show the 5 hours of the day where the most money is spent

In [24]:
%%sql

select hora, sum(importe) as "Importe"
from movimiento
group by hora
order by "Importe" desc
limit 5

5 rows affected.

[(15, Decimal('2256615.99')),
 (16, Decimal('1951272.07')),
 (17, Decimal('902056.68')),
 (14, Decimal('897004.71')),
 (19, Decimal('636204.99'))]

# Exercise 19
### Show the number of members of the 5 organizations with the most members (excluding null values)

In [25]:
%%sql
select organizacion, count(id_consejero)
from consejero
where organizacion is not null
group by organizacion
order by count(id_consejero) desc
limit 5

5 rows affected.

[(u'Partido Popular', 27L),
 (u'PSOE', 15L),
 (u'CC OO', 6L),
 (u'Izquierda Unida', 5L),
 (u'UGT', 4L)]

# Exercise 20
### Show the shops with more than 1 record per activity, sorting the result by the number of activities (descending) and the name of the shop (ascending). Limited to 5 records

In [26]:
%%sql
select comercio, id_actividad, count(id_actividad) as "Número de actividades"
from comercio
    where comercio is not null
    group by comercio, id_actividad
    having count(id_actividad) > 1
    order by count(id_actividad) desc, 
        comercio asc
limit 5

5 rows affected.

[(u'DATAFONOS PARKING P4', 4, 4L),
 (u'EMBASSY', 3, 4L),
 (u'LA VACA ARGENTINA', 3, 4L),
 (u'TICKETMASTER VENTA ENTRAD', 13, 4L),
 (u'APARCAMIENTO CLINICA LA CONCEP', 4, 3L)]

# Exercise 21
### Show the top 5 movements in terms of amount

In [27]:
%%sql
select a.nombre, b.fecha, b.importe
from consejero as a
    inner join movimiento as b on a.id_consejero = b.id_consejero
order by importe desc
limit 5

5 rows affected.

[(u'Ildefonso Jos\xe9 S\xe1nchez Barcoj', datetime.date(2009, 12, 30), Decimal('16921.75')),
 (u'Mat\xedas Amat Roca', datetime.date(2006, 12, 26), Decimal('15000.0')),
 (u'Ram\xf3n Ferraz Ricarte', datetime.date(2007, 12, 19), Decimal('13549.0')),
 (u'Miguel Blesa de la Parra', datetime.date(2006, 7, 19), Decimal('13148.29')),
 (u'Miguel Blesa de la Parra', datetime.date(2006, 4, 4), Decimal('12597.26'))]

# Exercise 22
### Show the shops with no associated activity

In [28]:
%%sql
select a.id_comercio, 
    a.comercio, 
    a.actividad_completa, 
    a.id_actividad, 
    b.id_actividad as id_actividad_1, 
    b.actividad
from comercio as a
    left join actividad as b on a.id_actividad = b.id_actividad
where b.actividad is null

4 rows affected.

[(4472, None, None, None, None, None),
 (9412, u'BLANCO-SUMMER-CC.ZIELO', u'BLANCO', None, None, None),
 (12725, u'SALA RETIRO CAJA DE MADRID', None, None, None, None),
 (13277, u'MOVISTAR', None, None, None, None)]

In [29]:
%%sql
select a.id_comercio, 
    a.comercio, 
    a.actividad_completa, 
    a.id_actividad, 
    b.id_actividad as id_actividad_1, 
    b.actividad
from comercio as a
    full outer join actividad as b on a.id_actividad = b.id_actividad
    order by actividad desc
limit 4

4 rows affected.

[(4472, None, None, None, None, None),
 (9412, u'BLANCO-SUMMER-CC.ZIELO', u'BLANCO', None, None, None),
 (13277, u'MOVISTAR', None, None, None, None),
 (12725, u'SALA RETIRO CAJA DE MADRID', None, None, None, None)]

# Exercise 23
### Show the aggregate amount per director and activity sorted by amount (descending). Only 5 records

In [30]:
%%sql
-- consejero a
-- movimiento b
-- comercio c
-- actividad d

select a.nombre, d.actividad, sum(b.importe)
from consejero a
    inner join movimiento as b on a.id_consejero = b.id_consejero
    inner join comercio as c on b.id_comercio = c.id_comercio
    inner join actividad as d on c.id_actividad = d.id_actividad
    group by nombre, actividad
    order by sum(b.importe) desc
limit 5

5 rows affected.

[(u'Ricardo Morado Iglesias', u'BANCO', Decimal('398902.0')),
 (u'Jos\xe9 Antonio Moral Sant\xedn', u'CA$H', Decimal('367809.82')),
 (u'Ildefonso Jos\xe9 S\xe1nchez Barcoj', u'BANCO', Decimal('219123.42')),
 (u'Ram\xf3n Ferraz Ricarte', u'CA$H', Decimal('172817.04')),
 (u'Ildefonso Jos\xe9 S\xe1nchez Barcoj', u'COMPRA BIENES', Decimal('154770.60'))]

In [31]:
%%sql
-- consejero a
-- movimiento b
-- comercio c
-- actividad d

select a.nombre, d.actividad, sum(b.importe)
from consejero a
    right join movimiento as b on a.id_consejero = b.id_consejero
    right join comercio as c on b.id_comercio = c.id_comercio
    right join actividad as d on c.id_actividad = d.id_actividad
group by nombre, actividad
order by sum(b.importe) desc
limit 5

5 rows affected.

[(u'Ricardo Morado Iglesias', u'BANCO', Decimal('398902.0')),
 (u'Jos\xe9 Antonio Moral Sant\xedn', u'CA$H', Decimal('367809.82')),
 (u'Ildefonso Jos\xe9 S\xe1nchez Barcoj', u'BANCO', Decimal('219123.42')),
 (u'Ram\xf3n Ferraz Ricarte', u'CA$H', Decimal('172817.04')),
 (u'Ildefonso Jos\xe9 S\xe1nchez Barcoj', u'COMPRA BIENES', Decimal('154770.60'))]

# Exercise 24
### Get the average daily amount, dividing the total amount by the number of days from the first move to the last move. Solve the exercise using a subquery so that the code is not duplicated

In [32]:
%%sql

select min(fecha) as "Inicio",
max(fecha) as "Fin",
max(fecha) - min(fecha) as "Número de días",
round(sum(importe) / (max(fecha) - min(fecha)),2) as "Importe Medio Diario"
from movimiento

1 rows affected.

[(datetime.date(2002, 12, 31), datetime.date(2012, 8, 28), 3528, Decimal('3304.76'))]

In [33]:
%%sql

with A as (
    select max(fecha) as "Fin",
          min(fecha) as "Inicio",
          sum(importe) as "Suma Importe",
          max(fecha) - min(fecha) as "Numero de dias"
    from movimiento
)
select "Inicio",
    "Fin", 
    "Numero de dias",
    round("Suma Importe" / ("Numero de dias"),2) as "Importe Medio Diario"
from A

1 rows affected.

[(datetime.date(2002, 12, 31), datetime.date(2012, 8, 28), 3528, Decimal('3304.76'))]

# Exercise 25
### Show the average of the average monthly amounts

In [34]:
%%sql

with A as (
    select date_part('month', fecha) as "Mes",
        avg(importe) as "Suma importe"
    from movimiento
    group by "Mes"
)
-- subquery: select * from A
    
select round(avg("Suma importe"),2) as "Media importes mensuales"
from A

1 rows affected.

[(Decimal('152.51'),)]

# Exercise 26
### Show the averages of the monthly amounts for January, February and March in a single row

In [35]:
%%sql

-- Subquery 1
with A as (
    select date_part('month', fecha) as "mes",
        round(avg(importe),2) as "importe"
    from movimiento
    where date_part('month', fecha) <= 3
    group by "mes"
)

select * from A
;

3 rows affected.

[(2.0, Decimal('142.28')), (1.0, Decimal('152.50')), (3.0, Decimal('150.12'))]

In [36]:
%%sql
--Lo he intentado resolver desde dos enfoques diferentes aunque parecidos
    
with A as (
    select date_part('month', fecha) as "mes",
        round(avg(importe),2) as "importe"
    from movimiento
    where date_part('month', fecha) <= 3
    group by "mes"
),


B as (
    select *,
            case when mes = 1 then importe
            else 0
        end as "1", 
            case when mes = 2 then importe
            else 0
        end as "2",
            case when mes = 3 then importe
            else 0
        end as "3" 
    from A   

)

select max("1") as enero, 
        max("2") as febrero, 
        max("3") as marzo 
from B

1 rows affected.

[(Decimal('152.50'), Decimal('142.28'), Decimal('150.12'))]

In [37]:
%%sql
with A as (
    select date_part('month', fecha) as "mes",
        round(avg(importe),2) as "importe"
    from movimiento
    where date_part('month', fecha) <= 3
    group by "mes"
),


B as (
    select sum(mes),
            case when mes = 1 then max(importe)
            else 0
        end as "Enero", 
            case when mes = 2 then max(importe)
            else 0
        end as "Febrero",
            case when mes = 3 then max(importe)
            else 0
        end as "Marzo" 
    from A  
    group by a.mes, a.importe

)

select sum("Enero") as "Enero", 
    sum("Febrero") as "Febrero", 
    sum("Marzo") as "Marzo"
    from B

1 rows affected.

[(Decimal('152.50'), Decimal('142.28'), Decimal('150.12'))]

## Exercise 27

### Show the 5 highest amounts below the average sorted by amount (descending) and date

In [38]:
%%sql
select avg(importe) from movimiento

1 rows affected.

[(Decimal('152.9316693774757995'),)]

In [39]:
%%sql
--Creo que no es exactamente asi como lo pedias

with tab as (
    select * from movimiento 
    where importe < (select avg(importe) from movimiento)
    order by importe desc, fecha
    limit 5
)

select a.nombre, b.fecha, b.importe
from consejero a
inner join tab b
on a.id_consejero = b.id_consejero
order by importe desc, fecha

5 rows affected.

[(u'Rub\xe9n Cruz Orive', datetime.date(2004, 11, 4), Decimal('152.91')),
 (u'Carmen Contreras G\xf3mez', datetime.date(2006, 3, 31), Decimal('152.91')),
 (u'Rub\xe9n Cruz Orive', datetime.date(2008, 5, 1), Decimal('152.91')),
 (u'Carmen Contreras G\xf3mez', datetime.date(2003, 4, 8), Decimal('152.89')),
 (u'Carmen Contreras G\xf3mez', datetime.date(2003, 7, 13), Decimal('152.89'))]

## Exercise 28
### Show the top 5 counselors with the highest average amount. Sort by amount (descending). Do it without using a JOIN

In [40]:
%%sql

with nombres_consej as (
    select id_consejero, nombre
    from consejero
),

imp as (select id_consejero, round(avg(importe),2) as "Importe Medio"
from movimiento
group by (id_consejero)
order by avg(importe) desc
)

select a.nombre as "Consejero", b."Importe Medio"
from nombres_consej a, imp b
where a.id_consejero = b.id_consejero
order by "Importe Medio" desc
limit 5

5 rows affected.

[(u'Ricardo Morado Iglesias', Decimal('1675.47')),
 (u'Gerardo D\xedaz Ferr\xe1n', Decimal('1357.81')),
 (u'Enrique de la Torre Mart\xednez', Decimal('820.71')),
 (u'Ram\xf3n Ferraz Ricarte', Decimal('477.60')),
 (u'Mat\xedas Amat Roca', Decimal('423.57'))]

## Exercise 29
### Show the least valuable move each counselor has made. Limit the output to 5 records sorted by amount (descending)

In [44]:
%%sql
with a as (
    select a.id_movimiento, b.nombre, a.fecha, importe, 
           rank (*) over (partition by nombre order by importe) as rank
    from movimiento a
    left join consejero b
    on a.id_consejero = b.id_consejero
)

select nombre, importe
from a
where rank = 1
order by importe desc
limit 5

5 rows affected.

[(u'Jos\xe9 Mar\xeda Garc\xeda Alonso', Decimal('106.0')),
 (u'Angel Rizaldos Gonz\xe1lez', Decimal('24.45')),
 (u'Rafael Pradillo Moreno de la Santa', Decimal('16.11')),
 (u'Gerardo D\xedaz Ferr\xe1n', Decimal('16.0')),
 (u'Joaqu\xedn Garc\xeda Pontes', Decimal('6.0'))]

## Exercise 30
### For each organization, show the difference with the organization that follows it (in order of expenditure)

In [45]:
%%sql
with a as(
    select a.organizacion, sum(b.importe) as importe
from consejero a
left join movimiento b
on a.id_consejero = b.id_consejero
where organizacion is not null
group by a.organizacion
) 

select organizacion, importe, 
    lead(importe) over (order by importe desc) as "importe siguiente",
    importe - lead(importe) over (order by importe desc) as "diferencia"
from a

10 rows affected.

[(u'Partido Popular', Decimal('2973883.25'), Decimal('1417616.63'), Decimal('1556266.62')),
 (u'PSOE', Decimal('1417616.63'), Decimal('831082.47'), Decimal('586534.16')),
 (u'Izquierda Unida', Decimal('831082.47'), Decimal('775272.60'), Decimal('55809.87')),
 (u'CC OO', Decimal('775272.60'), Decimal('352273.08'), Decimal('422999.52')),
 (u'UGT', Decimal('352273.08'), Decimal('191893.37'), Decimal('160379.71')),
 (u'Conf. de Cuadros', Decimal('191893.37'), Decimal('141454.77'), Decimal('50438.60')),
 (u'CEIM', Decimal('141454.77'), Decimal('130944.47'), Decimal('10510.30')),
 (u'Patronal (Unipyme)', Decimal('130944.47'), Decimal('105917.46'), Decimal('25027.01')),
 (u'Comisi\xf3n de Control', Decimal('105917.46'), Decimal('84184.5'), Decimal('21732.96')),
 (u'CEOE', Decimal('84184.5'), None, None)]